FemDesign.Geometry.Vector2d.#ctor
Parameterless constructor for

FemDesign.Geometry.Vector2d.#ctor(System.Double,System.Double)
Create new vector.
x: i-component.
y: j-component.

FemDesign.Geometry.Vector2d.To3d
Convert to 3d vector.
Returns:

FemDesign.Geometry.Vector2d.IsZero
Check if vector is zero.
Returns: